; =========================================================================================
; ========================= added by Ray Twitty (aka Shadows) =============================
; =========================================================================================
; ====================================== START ============================================
; =========================================================================================
; фикс статика биографии во вкладке "–анги"
align_proc
CUICharacterInfo__InitCharacter_fix proc
	; раскрасим текст
	push	255 ; B
	push	190 ; G
	push	190 ; R
	push	255 ; A
	mov     ecx, esi ; wnd
	call    CUIStatic__SetTextColor_script
	; SetTextComplexMode(true)
	push    true
	mov     edi, esi ; wnd
	call	CUIStatic__SetTextComplexMode
	;вырезанное
	call    CUIStatic__AdjustHeightToText
	jmp     return_CUICharacterInfo__InitCharacter_fix
CUICharacterInfo__InitCharacter_fix endp
; =========================================================================================
; ======================================= END =============================================
; =========================================================================================
